package com.huasisoft.operator;

public class OperatorDemo3 {
    public static void main(String[] args) {
        // 逻辑运算符 && || !
        // && 与运算，两个都为true，结果才为true
        // || 或运算，两个都为false，结果才为false
        // ! 非运算，取反
        boolean i = true;
        boolean j = false;
        System.out.println("逻辑运算符");
        System.out.println(i && j); // false
        System.out.println(i || j); // true
        System.out.println(!i); // false

        // 位运算符 & | ^ ~ << >> >>>
        // & 与运算，两个都为1，结果才为1
        // | 或运算，两个都为0，结果才为0
        // ^ 异或运算，两个相同为0，不同为1
        // ~ 取反运算，0变1，1变0
        // << 左移运算，左移n位，相当于乘以2的n次方
        // >> 右移运算，右移n位，相当于除以2的n次方
        // >>> 无符号右移运算，右移n位，左边补0
        int k = 10; // 1010
        int l = 20; // 10100
        System.out.println("位运算符");
        System.out.println(3 & 5); // 1 00001 运算过程：0011 & 0101 = 0001 = 1
        System.out.println(3 | 5); // 7 00111 运算过程：0011 | 0101 = 0111 = 7
        System.out.println(3 ^ 5); // 6 00110 运算过程：0011 ^ 0101 = 0110 = 6
        System.out.println(~3); // -4 111 ... 1100 运算过程：~0011 = 1100 = -4
        System.out.println(3 << 2); // 12 1100 运算过程：0011 << 2 = 1100 = 12
        System.out.println(3 >> 2); // 0 00 运算过程：0011 >> 2 = 0000 = 0
        System.out.println(3 >>> 2); // 0 00 运算过程：0011 >>> 2 = 0000 = 0


        // 运算符分类
        // 算术运算符
        // + - * / % ++ --
        // 自增自减运算符
        // ++ --
        // 关系运算符
        // > < >= <= == !=
        // 逻辑运算符
        // && || !
        // 位运算符
        // & | ^ ~ << >> >>>
        // 赋值运算符
        // = += -= *= /= %= &= |= ^= ~= <<= >>= >>>=
        // 三元运算符
        // ? :
        // 运算符优先级
        // 1. ()
        // 2. ++ -- ~ !
        // 3. * / %
        // 4. + -
        // 5. << >> >>>
        // 6. > >= < <=
        // 7. == !=
        // 8. &
        // 9. ^
        // 10. |
        // 11. &&
        // 12. ||
        // 13. ? :
        // 14. = += -= *= /= %= &= |= ^= ~= <<= >>= >>>=




    }
}
